Repository: yasinertekin/yasin-ertekin
Catalog: lib/l10n/app_*.arb
Languages: tr

# profession
source: Flutter Developer & Mobile Engineer
tr: Flutter Geliştirici & Mobil Geliştirici

# about
source: A mobile application developer specialized in Flutter, currently learning Swift.
tr: Flutter'da uzmanlaşmış, Swift öğrenmeye devam eden bir mobil uygulama geliştiriciyim.

# aboutTitle
source: About Me
tr: Hakkımda

# aboutContent
source: I'm a passionate mobile app developer with strong experience in building high-quality applications using Flutter. I'm currently expanding my skill set by learning Swift. I enjoy designing intuitive user interfaces and solving complex technical challenges.
tr: Flutter ile yüksek kaliteli mobil uygulamalar geliştirme konusunda güçlü bir deneyime sahibim. Şu anda Swift öğrenerek yeteneklerimi genişletiyorum. Kullanıcı dostu arayüzler tasarlamayı ve karmaşık teknik sorunlara yaratıcı çözümler üretmeyi seviyorum.

# projectsTitle
source: Projects
tr: Projeler

# contactTitle
source: Contact
tr: İletişim

# themeSwitch
source: Switch Theme
tr: Temayı Değiştir

# languageSwitch
source: Change Language
tr: Dili Değiştir

source: Download CV
tr: CV'yi İndir

# viewGitHub
source: View on GitHub
tr: GitHub'da Gör

# viewAppStore
source: View on App Store
tr: App Store'da Gör

# viewPlayStore
source: View on Play Store
tr: Play Store'da Gör

# footerRights
source: All rights reserved.
tr: Tüm hakları saklıdır.

source: Built with Flutter
tr: Flutter ile geliştirildi

# samaticaTitle
source: Samatica AI: Your Smart Assistant
tr: Samatica AI: Yapay Zeka Asistanı

# samaticaDescription
source: Samatica AI is a next-generation assistant app that empowers users to chat with advanced AI models like ChatGPT, Gemini, and Claude, analyze documents, generate visuals, and perform smart web searches. It also features AI personas such as psychologists and dietitians for personalized guidance. The app is built entirely with Flutter and Firebase, and uses RevenueCat for subscription management.
tr: Samatica AI, kullanıcıların ChatGPT, Gemini ve Claude gibi güçlü yapay zeka modelleriyle sohbet edebildiği, belgeleri analiz edebildiği, görsel oluşturabildiği ve web üzerinde akıllı aramalar yapabildiği yeni nesil bir yapay zeka asistanıdır. Ayrıca psikolog ve diyetisyen gibi kişiselleştirilmiş yapay zeka asistanlarını da içerir. Uygulama Flutter ve Firebase teknolojileriyle geliştirilmiş, abonelik sistemi için RevenueCat ile entegre edilmiştir.

# moonxTitle
source: Moonx: Horoscope & Meditation
tr: Moonx: Burçlar & Meditasyon

# moonxDescription
source: Moonx is a Flutter-based mobile app that delivers daily horoscopes, lunar guidance, weather forecasts, and calming meditation music. It features seamless API integrations, Bloc-based state management, and a refined user experience.
tr: Moonx, kullanıcılara günlük burç yorumları, ay döngüsüne dayalı tavsiyeler, hava durumu tahminleri ve meditasyon müzikleri sunan Flutter tabanlı bir mobil uygulamadır. Gelişmiş kullanıcı deneyimi sunan uygulama; çoklu API entegrasyonu, Bloc tabanlı durum yönetimi ve şık bir tasarıma sahiptir.
